SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_rfsense.h
/** @} End of group MGM22_RFSENSE */

/**************************************************************************//**
 * @addtogroup MGM22_RFSENSE
 * @{
 * @defgroup MGM22_RFSENSE_BitFields RFSENSE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for RFSENSE EN */
#define _RFSENSE_EN_RESETVALUE                   0x00000000UL                           /**< Default value for RFSENSE_EN                */
#define _RFSENSE_EN_MASK                         0x00000001UL                           /**< Mask for RFSENSE_EN                         */
#define RFSENSE_EN_EN                            (0x1UL << 0)                           /**< RFSENSE Enable                              */
#define _RFSENSE_EN_EN_SHIFT                     0                                      /**< Shift value for RFSENSE_EN                  */
#define _RFSENSE_EN_EN_MASK                      0x1UL                                  /**< Bit mask for RFSENSE_EN                     */
#define _RFSENSE_EN_EN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for RFSENSE_EN                 */
#define RFSENSE_EN_EN_DEFAULT                    (_RFSENSE_EN_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for RFSENSE_EN         */

/* Bit fields for RFSENSE EM4WUEN */
#define _RFSENSE_EM4WUEN_RESETVALUE              0x00000000UL                            /**< Default value for RFSENSE_EM4WUEN           */
#define _RFSENSE_EM4WUEN_MASK                    0x00000001UL                            /**< Mask for RFSENSE_EM4WUEN                    */
#define RFSENSE_EM4WUEN_EM4WUEN                  (0x1UL << 0)                            /**< EM4 WakeUp Enable                           */
#define _RFSENSE_EM4WUEN_EM4WUEN_SHIFT           0                                       /**< Shift value for RFSENSE_EM4WUEN             */
#define _RFSENSE_EM4WUEN_EM4WUEN_MASK            0x1UL                                   /**< Bit mask for RFSENSE_EM4WUEN                */
#define _RFSENSE_EM4WUEN_EM4WUEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_EM4WUEN            */
#define RFSENSE_EM4WUEN_EM4WUEN_DEFAULT          (_RFSENSE_EM4WUEN_EM4WUEN_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_EM4WUEN    */

/* Bit fields for RFSENSE CFG */
#define _RFSENSE_CFG_RESETVALUE                  0x03800000UL                            /**< Default value for RFSENSE_CFG               */
#define _RFSENSE_CFG_MASK                        0x0780000DUL                            /**< Mask for RFSENSE_CFG                        */
#define RFSENSE_CFG_PREAMBLELEN                  (0x1UL << 0)                            /**< Number of Preamble bits                     */
#define _RFSENSE_CFG_PREAMBLELEN_SHIFT           0                                       /**< Shift value for RFSENSE_PREAMBLELEN         */
#define _RFSENSE_CFG_PREAMBLELEN_MASK            0x1UL                                   /**< Bit mask for RFSENSE_PREAMBLELEN            */
#define _RFSENSE_CFG_PREAMBLELEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_PREAMBLELEN_DEFAULT          (_RFSENSE_CFG_PREAMBLELEN_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define _RFSENSE_CFG_SYNCWORDLEN_SHIFT           2                                       /**< Shift value for RFSENSE_SYNCWORDLEN         */
#define _RFSENSE_CFG_SYNCWORDLEN_MASK            0xCUL                                   /**< Bit mask for RFSENSE_SYNCWORDLEN            */
#define _RFSENSE_CFG_SYNCWORDLEN_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_SYNCWORDLEN_DEFAULT          (_RFSENSE_CFG_SYNCWORDLEN_DEFAULT << 2) /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define _RFSENSE_CFG_ENERGYDUR_SHIFT             23                                      /**< Shift value for RFSENSE_ENERGYDUR           */
#define _RFSENSE_CFG_ENERGYDUR_MASK              0x3800000UL                             /**< Bit mask for RFSENSE_ENERGYDUR              */
#define _RFSENSE_CFG_ENERGYDUR_DEFAULT           0x00000007UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur1ms            0x00000000UL                            /**< Mode dur1ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur2ms            0x00000001UL                            /**< Mode dur2ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur4ms            0x00000002UL                            /**< Mode dur4ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur8ms            0x00000003UL                            /**< Mode dur8ms for RFSENSE_CFG                 */
#define _RFSENSE_CFG_ENERGYDUR_dur16ms           0x00000004UL                            /**< Mode dur16ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur32ms           0x00000005UL                            /**< Mode dur32ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur64ms           0x00000006UL                            /**< Mode dur64ms for RFSENSE_CFG                */
#define _RFSENSE_CFG_ENERGYDUR_dur128ms          0x00000007UL                            /**< Mode dur128ms for RFSENSE_CFG               */
#define RFSENSE_CFG_ENERGYDUR_DEFAULT            (_RFSENSE_CFG_ENERGYDUR_DEFAULT << 23)  /**< Shifted mode DEFAULT for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur1ms             (_RFSENSE_CFG_ENERGYDUR_dur1ms << 23)   /**< Shifted mode dur1ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur2ms             (_RFSENSE_CFG_ENERGYDUR_dur2ms << 23)   /**< Shifted mode dur2ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur4ms             (_RFSENSE_CFG_ENERGYDUR_dur4ms << 23)   /**< Shifted mode dur4ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur8ms             (_RFSENSE_CFG_ENERGYDUR_dur8ms << 23)   /**< Shifted mode dur8ms for RFSENSE_CFG         */
#define RFSENSE_CFG_ENERGYDUR_dur16ms            (_RFSENSE_CFG_ENERGYDUR_dur16ms << 23)  /**< Shifted mode dur16ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur32ms            (_RFSENSE_CFG_ENERGYDUR_dur32ms << 23)  /**< Shifted mode dur32ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur64ms            (_RFSENSE_CFG_ENERGYDUR_dur64ms << 23)  /**< Shifted mode dur64ms for RFSENSE_CFG        */
#define RFSENSE_CFG_ENERGYDUR_dur128ms           (_RFSENSE_CFG_ENERGYDUR_dur128ms << 23) /**< Shifted mode dur128ms for RFSENSE_CFG       */
#define RFSENSE_CFG_LEGACYMODE                   (0x1UL << 26)                           /**< RFSENSE Legacy Mode                         */
#define _RFSENSE_CFG_LEGACYMODE_SHIFT            26                                      /**< Shift value for RFSENSE_LEGACYMODE          */
#define _RFSENSE_CFG_LEGACYMODE_MASK             0x4000000UL                             /**< Bit mask for RFSENSE_LEGACYMODE             */
#define _RFSENSE_CFG_LEGACYMODE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for RFSENSE_CFG                */
#define RFSENSE_CFG_LEGACYMODE_DEFAULT           (_RFSENSE_CFG_LEGACYMODE_DEFAULT << 26) /**< Shifted mode DEFAULT for RFSENSE_CFG        */

